<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"7ad3fa34ce19270dcaa2084686483226a67100bbe130f43ce74c63ef0dde3a55","plan_job_ref":"Job CICD for Splitrr Infra #49 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10676810186","plan_out_hash":"62fa1bfce3a860ca8c5c0dd5b898c2a56c82b01f72c9cbf1ee8fd71383dad933","plan_hash":"d1ec2f45a2f25f5a0a9a35beeceb2287ec9d4691471fb458e36f155161155d81","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs-ec2.aws_ecs_service.app will be updated in-place
!~  resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:us-east-1:949263681218:service/EC2-ECS-CLUSTER/splitrr-dev-backend-ecs-ec2-service"
        name                               = "splitrr-dev-backend-ecs-ec2-service"
        tags                               = {
            "Name" = "splitrr-dev-backend-ecs-ec2-service"
        }
!~      task_definition                    = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:4" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (6 unchanged blocks hidden)
    }

  # module.ecs-ec2.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
!~      arn                      = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:4" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   mountPoints      = []
                    name             = "splitrr-dev-backend-ecs-ec2-container"
!~                  portMappings     = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
!~                  secrets          = [
#                        (2 unchanged elements hidden)
                        {
                            name      = "COGNITO_USER_POOL_ID"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:COGNITO_USER_POOL_ID::"
                        },
!~                      {
!~                          name      = "DB_URL" -> "DATABASE_URL"
#                            (1 unchanged attribute hidden)
                        },
                        {
                            name      = "PORT"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:949263681218:secret:splitrr-dev-secret-manager-JNtaW7:PORT::"
                        },
#                        (3 unchanged elements hidden)
                    ]
-                   systemControls   = []
-                   volumesFrom      = []
#                    (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "************************************" -> (known after apply)
!~      revision                 = 4 -> (known after apply)
        tags                     = {
            "Name" = "splitrr-dev-backend-ecs-ec2-task-def"
        }
#        (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #49](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10676810186)